//: Playground - noun: a place where people can play

import UIKit

/***************************基本数据类型*************************/
/**************************************************************
 1.整数:  Int
 2.浮点数: Double表示64位浮点数,Float表示32位浮点数
 3.布尔类型: Bool,布尔值只有 true 和 false 两种
 4.字符串: String
 5.字符: Character
 ***************************************************************/

/***************************变量和常量*************************/
/***************************************************************
 1.变量:值能被修改,var 修饰
 2.常量:值不能被修改,let 修饰
 ***************************************************************/

var a = 20

a = 10

let b = 20

// b = 10 // 常量不能更改 note: change 'let' to 'var' to make it mutable


/****************************************************************
 1.会自动推导声明的变量或常量的属性
 2.使用【option + 单击】键查看属性的类型
 ****************************************************************/

// 1.自动推导类型
let str = "swift" //str 自动推导 为 String 类型 === let str: String = "swift"
let intValue = 10; // let intValue: Int = 10
let doubleValue = 1.2 //let doubleValue: Double = 1.2

// 如果指明具体类型 用 标示符:类型 = XXX 这样 具体指定类型
// 2.指定数据类型
let floatValue:Float = 10





